# tap
#
# $ brew tap
#
tap 'caskroom/cask'
tap 'homebrew/core'
tap 'homebrew/bundle'

# brew
brew 'ghq'
brew 'gibo'
brew 'go'
brew 'graphviz'
brew 'jq'
brew 'libxml2'
brew 'libxslt'
brew 'nkf'
brew 'node'
brew 'mas'
brew 'packer'
brew 'peco'
brew 'python'
brew 'rbenv'
brew 'redis'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'zsh'

# cask
#
# $ brew cask list
#
cask 'atom'
cask 'dropbox'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'

# mas
#
# $ mas list
#
mas 'LINE', id: 539883307
mas 'Skitch', id: 803453959
mas 'Slack', id: 803453959
mas 'Xcode', id: 497799835
