# tap
#
# $ brew tap
#
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'FelixKratz/formulae'
tap 'nikitabobko/tap'

# brew
brew 'anyenv'
brew 'bat'
brew 'borders'
brew 'circleci'
brew 'clisp'
brew 'csview' # 事前に brew tap wfxr/csview が必要
brew 'direnv'
brew 'gh'
brew 'ghq'
brew 'gibo'
brew 'go'
brew 'hub'
brew 'jq'
brew 'libxml2'
brew 'libxslt'
brew 'lsd'
brew 'mas'
brew 'nkf'
brew 'openapi-generator'
brew 'peco'
brew 'sketchybar'
brew 'starship'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'watchman'
brew 'wget'
brew 'zsh'

# cask
#
# $ brew cask list
#
cask 'google-chrome'
cask 'iterm2'
cask 'karabiner-elements'
cask 'visual-studio-code'
# cask 'clipy' # M1 未対応
cask '1password'
cask 'aerospace'
cask 'alfred'
cask 'alt-tab'
cask 'ghostty'
cask 'kindle'
cask 'zed'
cask 'font-hack-nerd-font' # 事前に brew tap homebrew/cask-fonts が必要

# mas
#
# $ mas list
#
mas 'Slack', id: 803453959
# mas 'Xcode', id: 497799835
