# tap
#
# $ brew tap
#
tap 'homebrew/core'
tap 'homebrew/bundle'

# brew
brew 'anyenv'
brew 'circleci'
brew 'direnv'
brew 'ghq'
brew 'gibo'
brew 'go'
brew 'hub'
brew 'jq'
brew 'libxml2'
brew 'libxslt'
brew 'nkf'
brew 'mas'
brew 'openapi-generator'
brew 'peco'
brew 'postgresql'
brew 'redis'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'zsh'

# cask
#
# $ brew cask list
#
cask 'dropbox'
cask 'google-chrome'
cask 'iterm2'
cask 'karabiner-elements'
cask 'visual-studio-code'
cask 'clipy'
cask '1password'
cask 'adoptopenjdk'
cask 'alfred'
cask 'kindle'
cask 'docker'

# mas
#
# $ mas list
#
mas 'Bear', id: 1091189122
mas 'LINE', id: 539883307
mas 'Skitch', id: 803453959
mas 'Slack', id: 803453959
mas 'Xcode', id: 497799835
